app/Filament/Resources/PolarChartDashboardResource/Widgets/DashboardChart.php

select status, COUNT(*) as total from `orders` group by `status`
---
    protected function getData(): array
    {
        // Status labels and corresponding colors
        $statusLabels = [
            0 => 'Red',       // Pending
            1 => 'Green',     // Paid
            2 => 'Yellow',    // On Its Way
            3 => 'Grey',      // Cancelled
            4 => 'Blue',      // Delivered
        ];

        $statusColors = [
            0 => 'rgb(255, 99, 132)',   // Red
            1 => 'rgb(75, 192, 192)',   // Green
            2 => 'rgb(255, 205, 86)',   // Yellow
            3 => 'rgb(201, 203, 207)',  // Grey
            4 => 'rgb(54, 162, 235)',   // Blue
        ];

        // Get counts grouped by status
        $orders = Order::selectRaw('status, COUNT(*) as total')
            ->groupBy('status')
            ->pluck('total', 'status')
            ->toArray();