app/Http/Controllers/PageController.php

                ->with(['shop:id,name'])
                ->get();
        });
        $latest_shops = \Cache::remember('latest_shops', 3600, function () {
            return Shop::query()
                ->where('status', 1)
                ->whereHas('products', fn($q) => $q->whereNull('parent_id'))
                ->latest()
                ->limit(8)
                ->with(['products:id,name,shop_id,slug,images,views,image,sale_price,price,post_code,status'])
                ->get();
        });
---
select * from `shops` where `status` = 1 and exists (select * from `products` where `shops`.`id` = `products`.`shop_id` and `parent_id` is null and `parent_id` is null) order by `created_at` desc limit 8