app/Http/Controllers/PageController.php

    public function home()
    {
        // Cache the entire homepage data together to reduce individual repository calls
        $homeData = Cache::remember('homepage_data', 1800, function () { // 30 minutes cache
            return [
                'latest_products' => ProductRepository::getLatestProducts(),
                'bestsaleproducts' => ProductRepository::getBestsaleProducts(),
                'recommandProducts' => ProductRepository::getRecommandProducts(),
                'latest_shops' => ShopRepsitory::getLatestShops(),
                'prodcats' => CategoryRepository::getAllCategoriesWithProducts(),
                'sliders' => Slider::latest()->get()
            ];
        });
---
select * from `sliders` order by `created_at` desc

    public function product_details($slug)
    {
        $product = Product::where('slug', $slug)->firstOrFail();
        $related_products = Product::whereNull('parent_id')->limit(16)->get();
---
select * from `products` where `parent_id` is null and 0 = 1