app/Filament/Resources/ShopResource.php

    public static function table(Table $table): Table
    {
        return $table
            ->columns([
                ImageColumn::make('logo')
                    ->label('Logo')
                    ->circular()
                    ->size(48)
                    ->toggleable(),
                ImageColumn::make('banner')
                    ->label('Banner')
                    ->size(64)
                    ->toggleable(),
                TextColumn::make('name')
                    ->label('Shop Name')
                    ->searchable()
                    ->sortable()
                    ->badge()
                    ->color('primary')
                    ->toggleable(),
                TextColumn::make('user.name')
                    ->label('Owner')
                    ->icon('heroicon-o-user')
---
select count(*) as aggregate from `shops`