app/Filament/Resources/VerificationResource.php

    public static function getNavigationBadge(): ?string
    {
        // TEMPORARILY DISABLED FOR DEBUGGING
        return null;

        return (string) Verification::count();
---
select count(*) as aggregate from `verifications`