app/Filament/Resources/VerificationResource.php

    public static function getNavigationBadge(): ?string
    {
        return (string) Verification::count();
---
select count(*) as aggregate from `verifications`